[
  {
    "id": "roo",
    "title": "Roo <small>( 2024 )</small>",
    "icon": "BROWSER",
    "role": "App Designer",
    "description": "ROO, the kangaroo that delivers GitHub messages. Application character and overall project design.",
    "skill": ["Figma", "Procreate App","Illustrator"],
    "link": "",
    "year": "2024"
  },
  {
    "id": "rinventory",
    "title": "Rinventory <small>( 2022 )</small>",
    "icon": "BROWSER",
    "role": "Web Designer, Front Developer",
    "description": "A website where users can manage and sell their electronic devices, similar to an item inventory in a game. Users can upload information about their items and organize them into folders. Detailed information such as quantity, price, and barcode can be added to increase buyer trust during sales. If a user wants to sell an item, they can directly list it for sale on the platform.",
    "skill": ["Javascript", "HTML", "CSS", "Adobe XD", "Illustrator"],
    "link": "",
    "year": "2022"
  },
  {
    "id": "kioskApp",
    "title": "Kiosk Administration App <small>( 2020 )</small>",
    "icon": "BROWSER",
    "role": "App Designer",
    "description": "An administrative application for managing the access control kiosks installed for COVID-19 prevention. It allows users to monitor and manage device status, entry logs, and visitor information.An administrative application for managing the access control kiosks installed for COVID-19 prevention. It allows users to monitor and manage device status, entry logs, and visitor information.",
    "skill": ["Illustrator", "Adobe XD"],
    "link": "",
    "year": "2020"
  },
  {
    "id": "householdApp",
    "title": "Household App <small>( 2023 )</small>",
    "icon": "BROWSER",
    "role": "Web Designer, Front Developer",
    "description": "This is my first React project, starting with the idea of creating a household budget app that allows users to compare the prices and purchasing locations of frequently bought items. Since it's my first project, the focus will be on making it function properly rather than on the concept or final polish, and I plan to complete the first version with this in mind.",
    "skill": ["React", "Adobe XD", "GitHub"],
    "link": "",
    "year": "202x"
  },
  {
    "id": "realseller",
    "title": "Realseller <small>( 2022 )</small>",
    "icon": "BROWSER",
    "role": "Web Designer, Front Developer",
    "description": "A company introduction website for ″RealSeller.″ This project involved redesigning the existing company website, splitting it into separate sections for service introduction and company information. RealSeller offers a unique identity verification service that certifies trusted sellers. To save time, a template using CSS utility classes was purchased and used for the design.",
    "skill": ["Javascript", "jQuery", "HTML", "CSS", "Adobe XD", "Illustrator", "Procreate App"],
    "link": "",
    "year": "2022"
  },
  {
    "id": "sohee",
    "title": "How to kill time (PC) <small>( 2021 )</small>",
    "icon": "LINK",
    "role": "Web Designer, Front Developer",
    "description": "A hobby recommendation website I created for a friend who was job hunting. This site, prepared as a Christmas gift, suggests activities that can help refresh and energize someone during the challenging moments of job searching. I designed it with refreshing colors and icons, using a tangerine as the character for the website.",
    "skill": ["jQuery", "HTML", "CSS", "Illustrator"],
    "link": "site/sohee",
    "year": "2021"
  },
  {
    "id": "soop",
    "title": "Soop <small>( 2019 )</small>",
    "icon": "LINK",
    "role": "Web Designer, Front Developer",
    "description": "A recipe website with the concept of making it easy to cook healthy meals. This project, done in a team of two during a government-supported course, offers various features such as ordering ingredients, checking the fridge, and managing personal meal plans. It was designed with large fonts to ensure that the instructions are easy to read even while cooking.",
    "skill": ["jQuery", "HTML", "CSS", "Photoshop"],
    "link": "site/soop",
    "year": "2019"
  },
  {
    "id": "todoApp",
    "title": "Todo App <small>( 2023 )</small>",
    "icon": "LINK",
    "role": "Web Designer, Front Developer",
    "description": "A staple project in JavaScript and a great opportunity to practice various concepts is the ″To-Do App.″ It categorizes tasks into work-related and personal tasks, displaying them with different colors, and shows progress through a bar chart. This project allowed me to dive deeper into vanilla JavaScript, and I used Tailwind for styling.",
    "skill": ["Javascript", "HTML", "CSS", "Tailwind"],
    "link": "site/todoApp",
    "year": "2023"
  },
  {
    "id": "rasApp",
    "title": "RAS App <small>( 2022 )</small>",
    "icon": "BROWSER",
    "role": "App Designer",
    "description": "A mobile application designed to make the RAS (Real Authentication Service) more convenient to use. The app allows users to sign up for the service, complete identity verification, search for sellers, and use the RealSeller online ID for verification.",
    "skill": ["Illustrator", "Adobe XD"],
    "link": "",
    "year": "2022"
  },
  {
    "id": "treasureHunt",
    "title": "Treasure Hunt (Mobile) <small>( 2020 )</small>",
    "icon": "LINK",
    "role": "Web Designer, Front Developer",
    "description": "A treasure hunt website where users answer quiz questions to find hidden gifts. This is a small project I worked on personally, where users receive gradual hints about the direction to the hidden gift's location as they answer the questions correctly.",
    "skill": ["jQuery", "HTML", "CSS", "Adobe XD", "Illustrator"],
    "link": "site/treasureHunt",
    "year": "2020"
  },
  {
    "id": "portfolioV1",
    "title": "Portfolio Website.v1 <small>( 2019 )</small>",
    "icon": "LINK",
    "role": "Web Designer, Front Developer",
    "description": "The first portfolio website I created. With the intention of making it easy and comfortable for visitors to view, I chose colors and a main image that suited this concept. I used a library to implement a detailed portfolio page, which made the work much easier.",
    "skill": ["jQuery", "HTML", "CSS", "Photoshop"],
    "link": "v1",
    "year": "2019"
  },
  {
    "id": "graphicDesign",
    "title": "Graphic Design",
    "icon": "BROWSER",
    "role": "Graphic Designer",
    "description": "These are various types of designs I worked on while working at a design agency and as a freelance designer.",
    "skill": ["Illustrator", "Photoshop", "InDesign"],
    "link": "",
    "year": ""
  },
  {
    "id": "blackjack",
    "title": "Blackjack <small>( 2023 )</small>",
    "icon": "BROWSER",
    "role": "",
    "description": "My first Java project was a Blackjack card game. I used a singleton class to generate random numbers for the card values and displayed the corresponding card images. While I couldn't focus on the design of the project, it was a valuable experience that helped me become more familiar with the concept of classes and improved my skills in refactoring.",
    "skill": ["Java", "GitHub"],
    "link": "",
    "year": "2023"
  },
  {
    "id": "keyboard",
    "title": "Virtual Keyboard <small>( 2023 )</small>",
    "icon": "LINK",
    "role": "Web Designer, Front Developer",
    "description": "A virtual keyboard that allows text input through clicks or touches without the need for a physical keyboard. The keyboard was created by defining the key names ('key'), values ('value'), and methods within an object, and adding events to each key. This approach allowed me to build the entire keyboard using a single object.",
    "skill": ["Javascript", "HTML", "CSS"],
    "link": "site/keyboard",
    "year": "2023"
  },
  {
    "id": "memeGen",
    "title": "Meme Creator <small>( 2023 )</small>",
    "icon": "LINK",
    "role": "Web Designer, Front Developer",
    "description": "A website that allows you to create and save simple image memes. By using an image object, you can load a file and place the image onto a canvas. Then, you can add text to the top and bottom of the canvas, combining it with the image to create your own custom meme.",
    "skill": ["Javascript", "HTML", "CSS"],
    "link": "site/memeGen",
    "year": "2023"
  },
  {
    "id": "kiosk",
    "title": "Visitor Management Kiosk <small>( 2020 )</small>",
    "icon": "BROWSER",
    "role": "Designer",
    "description": "A kiosk for access control to prevent the spread of COVID-19. This kiosk guides users through a 4-step process for entry: mask-wearing check, hand sanitization, temperature measurement, and identity verification, and issues certification upon successful completion.",
    "skill": ["Illustrator"],
    "link": "",
    "year": "2020"
  },
  {
    "id": "robot",
    "title": "Disinfection Robot <small>( 2020 )</small>",
    "icon": "BROWSER",
    "role": "Designer",
    "description": "A robot that measures and manages air quality while moving around indoors. It expresses the air quality status through its facial expressions and shows the current functions it is performing.",
    "skill": ["Illustrator"],
    "link": "",
    "year": "2020"
  },
  {
    "id": "photoRetouch",
    "title": "Photo Editing",
    "icon": "BROWSER",
    "role": "Photo Editor",
    "description": "These are before-and-after photos of a product I edited while working as a freelance product photo retoucher.",
    "skill": ["Photoshop"],
    "link": "",
    "year": ""
  }
]